# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

np.random.seed(101) 
# seed() makes random number predictable.
# The parameter is any fixed number
# With the seed() reset every time, the same set of random numbers appear with every invocation.

df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df.shape[0] # Number of rows

5

In [32]:
df.shape[1] # Number of Columns

4

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [3]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [4]:
type(df['W'])

pandas.core.series.Series

In [5]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [6]:
type(df[['W','Z']])

pandas.core.frame.DataFrame

**Creating a new column(s):**

In [7]:
df['new_col1'] = df['W'] + df['Y']

In [8]:
df['new_col2'] = df['W'] - df['Y']

In [9]:
df

          W         X         Y         Z  new_col1  new_col2
A  2.706850  0.628133  0.907969  0.503826  3.614819  1.798880
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959  1.499195
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -2.546982
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  1.121933
E  0.190794  1.978757  2.605967  0.683509  2.796762 -2.415173

**Removing Columns:**

In [10]:
# Method 1
df.drop(['new_col1'], axis=1) #-- Removing one column

          W         X         Y         Z  new_col2
A  2.706850  0.628133  0.907969  0.503826  1.798880
B  0.651118 -0.319318 -0.848077  0.605965  1.499195
C -2.018168  0.740122  0.528813 -0.589001 -2.546982
D  0.188695 -0.758872 -0.933237  0.955057  1.121933
E  0.190794  1.978757  2.605967  0.683509 -2.415173

In [11]:
df.drop(['new_col1', 'new_col2'], axis=1) #-- Removing multiple columns

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
# Actually, previous 'drop' was a 'soft-drop'; use 'inplace= True' for a'hard-drop'!
df

          W         X         Y         Z  new_col1  new_col2
A  2.706850  0.628133  0.907969  0.503826  3.614819  1.798880
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959  1.499195
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -2.546982
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  1.121933
E  0.190794  1.978757  2.605967  0.683509  2.796762 -2.415173

In [14]:
# Method 2 -- Index base
df.drop(df.columns[[4, 5]], axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df

          W         X         Y         Z  new_col1  new_col2
A  2.706850  0.628133  0.907969  0.503826  3.614819  1.798880
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959  1.499195
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -2.546982
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  1.121933
E  0.190794  1.978757  2.605967  0.683509  2.796762 -2.415173

<img src="iloc_loc.png">
Ref: https://www.shanelynn.ie/select-pandas-dataframe-rows-and-columns-using-iloc-loc-and-ix/

#--------------------------------------------
#         Selections using iloc 
#--------------------------------------------

# Rows:
df.iloc[0] # first row of dataframe
df.iloc[1] # second row of dataframe 
df.iloc[-1] # last row of dataframe 

# Columns:
df.iloc[:,0] # first column of dataframe 
df.iloc[:,1] # second column of dataframe 
df.iloc[:,-1] # last column of dataframe 


# Multiple row and column selections using iloc and DataFrame
data.iloc[0:5] # first five rows of dataframe
data.iloc[:, 0:2] # first two columns of data frame with all rows
data.iloc[[0,3,6,24], [0,5,6]] # 1st, 4th, 7th, 25th row + 1st 6th 7th columns
data.iloc[0:5, 5:8] # first 5 rows and 5th, 6th, 7th columns of data frame


#--------------------------------------------
#         Selections using loc 
#--------------------------------------------

# Select rows with index values 'Andrade' and 'Veness', with all columns between 'city' and 'email'
data.loc[['Andrade', 'Veness'], 'city':'email']
# Select same rows, with just 'first_name', 'address' and 'city' columns
data.loc['Andrade':'Veness', ['first_name', 'address', 'city']]
 
# Change the index to be based on the 'id' column
data.set_index('id', inplace=True)
# select the row with 'id' = 487
data.loc[487]

In [20]:
#Remove all columns between index 4 and beyond -- OR, new_col1 and new_col2
df.drop(df.iloc[:, 4:], axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df

          W         X         Y         Z  new_col1  new_col2
A  2.706850  0.628133  0.907969  0.503826  3.614819  1.798880
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959  1.499195
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -2.546982
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  1.121933
E  0.190794  1.978757  2.605967  0.683509  2.796762 -2.415173

In [22]:
df.drop(df.columns[[4, 5]], axis=1, inplace=True)

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Can also drop rows this way:

In [24]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

** Selecting Rows**

In [25]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

Or select based off of position instead of label

In [26]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [ ]:
df.loc['B','Y']

In [ ]:
df.loc[['A','B'],['W','Y']]

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [ ]:
df

In [ ]:
df>0

In [ ]:
df[df>0]

In [ ]:
df[df['W']>0]

In [ ]:
df[df['W']>0]['Y']

In [ ]:
df[df['W']>0][['Y','X']]

For two conditions you can use | and & with parenthesis:

In [ ]:
df[(df['W']>0) & (df['Y'] > 1)]

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [ ]:
df

In [ ]:
# Reset to default 0,1...n index
df.reset_index()

In [ ]:
newind = 'CA NY WY OR CO'.split()

In [ ]:
df['States'] = newind

In [ ]:
df

In [ ]:
df.set_index('States')

In [ ]:
df

In [ ]:
df.set_index('States',inplace=True)

In [ ]:
df

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [ ]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [ ]:
hier_index

In [ ]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [ ]:
df.loc['G1']

In [ ]:
df.loc['G1'].loc[1]

In [ ]:
df.index.names

In [ ]:
df.index.names = ['Group','Num']

In [ ]:
df

In [ ]:
df.xs('G1')

In [ ]:
df.xs(['G1',1])

In [ ]:
df.xs(1,level='Num')

## Next: Missing Data